Revit 2027 API
LinkLoadContent.GetLinkDataPath Method
 Returns the Link data path owned by this LinkLoadContent object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetLinkDataPath()
Public Function GetLinkDataPath As ModelPath
public:
ModelPath^ GetLinkDataPath()
member GetLinkDataPath : unit -> ModelPath
Return Value
ModelPath
 The Links data path owned by this LinkLoadContent object.
Remarks
 This path represents the physical location of the link. Revit will attempt to load the link from this location.
See Also
Reference
LinkLoadContent Class
Autodesk.Revit.DB Namespace